Tekla Open API Reference for Tekla Structures 2025
DistanceList.Parse Method
Overload List
Name | Description
Parse(String)
 Parses a distance list from a string representation.
Parse(String, IFormatProvider)
 Parses a distance list from a string representation.
Parse(String, IFormatProvider, Distance.UnitType)
 Parses a distance list from a string representation.
Top
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace